## 957818836222: CloudTrail
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`





```terraform
Plan: 1 to add, 0 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudtrail.satellite_trail will be created
  + resource "aws_cloudtrail" "satellite_trail" {
      + arn                           = (known after apply)
      + enable_log_file_validation    = false
      + enable_logging                = true
      + home_region                   = (known after apply)
      + id                            = (known after apply)
      + include_global_service_events = true
      + is_multi_region_trail         = true
      + is_organization_trail         = false
      + name                          = "CbsSatelliteTrail"
      + s3_bucket_name                = "cbs-satellite-957818836222"
      + s3_key_prefix                 = "cloudtrail_logs"
      + tags                          = {
          + "CostCentre" = "cbs-957818836222"
          + "Terraform"  = "true"
        }
      + tags_all                      = {
          + "CostCentre" = "cbs-957818836222"
          + "Terraform"  = "true"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

9 tests, 9 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
